{
    "questions": [
        {
            "question_text": "What is ComfyUI-Lora-Auto-Trigger-Words?",
            "answer_text": "ComfyUI-Lora-Auto-Trigger-Words is a project that provides custom nodes to access tags used to trigger Lora in ComfyUI."
        },
        {
            "question_text": "Is ComfyUI-Lora-Auto-Trigger-Words compatible with Stacked Loras?",
            "answer_text": "Yes, ComfyUI-Lora-Auto-Trigger-Words is compatible with Stacked Loras from https://github.com/LucianoCirino/efficiency-nodes-comfyui/releases."
        },
        {
            "question_text": "Does ComfyUI-Lora-Auto-Trigger-Words support Lycoris as well?",
            "answer_text": "Yes, ComfyUI-Lora-Auto-Trigger-Words supports both Lora and Lycoris."
        },
        {
            "question_text": "What are the different types of nodes available in ComfyUI-Lora-Auto-Trigger-Words?",
            "answer_text": "The nodes available are: LoraLoader (Vanilla or Advanced), LoraLoaderStacked (Vanilla or Avanced), TagsFormater, tagsSelector, FusionText, Randomizer, and TextInputBasic."
        },
        {
            "question_text": "What is the purpose of the LoraLoaderAdvanced and LoraLoaderStacked nodes?",
            "answer_text": "LoraLoaderAdvanced and LoraLoaderStacked nodes allow loading a lora either the normal way or the efficiency-nodes way and provide two custom outputs: civitai_tags_list and meta_tags_list."
        },
        {
            "question_text": "What is the function of the TagsFormater node?",
            "answer_text": "The TagsFormater node is a helper to show the available tag and their indexes."
        },
        {
            "question_text": "Can TagsSelectors be chained?",
            "answer_text": "Yes, TagsSelectors can be chained to select different tags with different weights."
        },
        {
            "question_text": "What is needed for the 'showText' node to know the content of the tag lists?",
            "answer_text": "For the 'showText' node to know the content of the tag lists, Custom-Scripts is recommended to be installed."
        },
        {
            "question_text": "What do the custom outputs civitai_tags_list and meta_tags_list provide?",
            "answer_text": "civitai_tags_list provides a Python list of the tags related to this lora on Civitai, while meta_tags_list provides a Python list of the tags used for training the lora embedded in it."
        },
        {
            "question_text": "What is the function of the 'tagsSelector' node?",
            "answer_text": "The 'tagsSelector' node allows filtering tags and applying a weight to them. It has four parameters: selector, weight, ensure_comma, and append_loraname_if_empty."
        }
    ]
}