[
    "Who is nihui",
    "Which specific locations should be modified?",
    "1+1",
    "Are there many contents that need to be modified?",
    "What can you do?",
    "Oh, no way",
    "FCOS",
    "How do I print it?",
    "?",
    "MMSelfSup",
    "Baidu",
    "What?",
    "Who are you?",
    "What about the historical issues?",
    "What kind of personality are you preset for?",
    "What role does the tracking area code TAC play in the SIM card authentication process? Please elaborate on the two-way authentication process, especially the TAC and cell ID parts",
    "DCOS",
    "Are you handsome?",
    "You said you are",
    "Put the two questions together and think about it",
    "Will ComfyUI be replaced?",
    "Why?",
    "What is the use of MMSelfSup?",
    "Is there a group number?",
    "Is there a communication group?",
    "What questions do you have?",
    "This garbage is slowly learning these things",
    "Can I find the installation manual above?",
    "xtcocotools Cannot install",
    "Is this the LLM model",
    "Online difficult sample mining",
    "What is the full name of SD webui",
    "What should I pay attention to when using scientific research instruments?",
    "Can ComfyUI be used with mobile phones?",
    "Wireless network in the scope of wireless LAN refers to 'wireless compatibility certification'",
    "What scenic spots do you know",
    "Suggest a healthy meal that could be cooked with the given ingredients.Carrots, onions, potatoes, garlic",
    "How do you determine the time difference between two time zones?",
    "Learn a new skill online in one hour.",
    "Brainstorm ways to reduce energy consumption in a home.",
    "Identify three pros and three cons of eating fast food.",
    "Compare a hurricane to a tornado",
    "Make a list of five precautions for travelling during the COVID-19 pandemic.",
    "Suggest two activities that can be done in a park.",
    "Create an outline for a short story set in a post-apocalyptic world",
    "Which is the most popular programming language as of 2021?",
    "Convert miles to kilometersMiles: 5",
    "What is executive functioning?",
    "Suggest three methods to improve communication in the workplace.",
    "Edit the sentence to use past simple tense.The dog barks.",
    "Given a pair of numbers, generate an equation that will produce an output as close to 50 as possible.5 and 8",
    "Classify the following sentence as affirmative or negative: “She hasn’t gone to the store yet”",
    "Compose a story about a child who heads out on a journey.",
    "Come up with a tagline for a green energy company.",
    "List the factors which may lead to imbalance in nature.",
    "Construct a system of equations to solve the following problem.A store sells sandwiches and drinks. There are 6 sandwiches and 5 drinks. Each sandwich costs $3 and each drink costs $2. The total cost is $21.",
    "Describe the most used transportation device in Egypt",
    "Describe the story arc of the movie Frozen.",
    "What is an object-oriented programming language?",
    "What is the most famous painting of Leonardo da Vinci?",
    "Name two world renowned artists.",
    "Generate an example of a saying that is related to the proverb \"A stitch in time saves nine\".",
    "Explain why the Moon rotates.",
    "Find and explain an example of a false assumption.",
    "Explain why the budget of a company is important.",
    "Given a person, suggest a creative project.A filmmaker",
    "Create a while loop that will print out \"Hello World\" 10 times.",
    "Design a room that follows the given style.Vintage style.",
    "Edit this sentence to make it sound more natural: \n\"Maybe it's because of the rain,\" he said.",
    "Describe how data is encoded and decoded.noinput",
    "Generate a number between 1 and 10.",
    "List 3 pros and 3 cons of eating a vegan diet.",
    "Construct a regular expression that matches a five-digit zipcode",
    "Is it possible to get a back-up for water tanks?",
    "Create 3 questions related to the article.WASHINGTON (CNN) -- A wide-open presidential race and a willingness by candidates, interest groups, unions and corporations to buy TV time will lead to historic spending for political and issue-advocacy advertising in the 2008 election cycle, an analysis shows.",
    "Provide a solution to this problem.A cyclist is biking from Point A to Point B. Along the way, he passes point C, which is one-third of the distance from A to B. At what point is the cyclist halfway to his destination?",
    "Give four examples of plant-based proteins.",
    "Make a comparison between two things.Dogs and cats",
    "Suggest five fun activities for a virtual team bonding session.",
    "Suggest a diet plan that is both healthy and affordable.",
    "Analyze the given sentence and explain the context in which the sentence could be applicable\"The sky is the limit\"",
    "Design a system to help manage customer support tickets.",
    "Connect the words in the sentence with a hyphenThe dog ran through the field",
    "Describe a process of cleaning silverware.",
    "Group these words as related topicsBaseball, basketball, football, tennis",
    "Are tarantulas poisonous? Give a detailed answer.",
    "Summarize the differences between a Microsoft Access and Microsoft Excel.",
    "Name five reasons why artificial intelligence is important for businesses.No input.",
    "Create a character description for a protagonist named Peter",
    "Explain the following statement: \"The project was cancelled due to budget constraints.\"",
    "Name three countries that border Russia.",
    "Describe the end product of this recipe.Ingredients \n- 2 cups of flour \n- 2/3 cup of sugar \n- 1/2 cup of butter \n- 1/2 teaspoon of baking powder \n- 1/2 teaspoon of salt \n- 2 eggs \n- 1 teaspoon of vanilla",
    "Design both a logo and a slogan for a laundry service company.",
    "Make a list of three endangered species.",
    "Write a poem that tells a romantic love story.",
    "Analyze the use of metaphors in the following textHer heart was a maelstrom, threatening to swallow her whole.",
    "Create a weather report in the current region.",
    "Describe a scientific experiment with sufficient detail for a reader to recreate it.",
    "Compare the given parts and identify the one with the highest performance.NVIDIA GeForce RTX 2060 Super vs NVIDIA GeForce RTX 2070",
    "Gather some recent data related to the increasing rates of unemployment.",
    "Rewrite the sentence: \"I should of been there earlier\""
]